Infineon/mtb-example-psoc6-radar-presence/source/cli_task.c
/*****************************************************************************
 * File name: cli_task.c
 *
 * Description: This file implements a terminal UI to configure parameters
 ** for radar presence application.

 *
*******************************************************************************
* Copyright 2024, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

#include <stdlib.h>

#include "cy_retarget_io.h"

#include "FreeRTOS.h"
#include "task.h"
#include "FreeRTOS_CLI.h"

#include "cli_task.h"

#include "xensiv_radar_presence.h"
#include "radar_config_optimizer.h"

/*******************************************************************************
 * Macros
 ********************************************************************************/
#define NUMBER_OF_COMMANDS (9)

/* Strings length */
#define MAX_INPUT_LENGTH  (50)
#define MAX_OUTPUT_LENGTH (100)

/* Strings for enable and disable */
#define ENABLE_STRING  ("enable")
#define DISABLE_STRING ("disable")

/* Max range min - max */
#define MAX_RANGE_MIN_LIMIT (0.66f)
#define MAX_RANGE_MAX_LIMIT (5.0f)

/* Macro threshold min - max */
#define MACRO_THRESHOLD_MIN_LIMIT (0.5f)
#define MACRO_THRESHOLD_MAX_LIMIT (2.0f)

/* Micro threshold min - max */
#define MICRO_THRESHOLD_MIN_LIMIT (0.2f)
#define MICRO_THRESHOLD_MAX_LIMIT (50.0f)

/* Names for presence mode */
#define MACRO_ONLY_STRING      ("macro_only")
#define MICRO_ONLY_STRING      ("micro_only")
#define MICRO_IF_MACRO_STRING  ("micro_if_macro")
#define MICRO_AND_MACRO_STRING ("micro_and_macro")

/* Keyboard keys */
#define ENTER_KEY     (0x0D)
#define ESC_KEY       (0x1B)
#define BACKSPACE_KEY (0x08)

/*******************************************************************************
 * Local Declarations
 ********************************************************************************/
typedef struct
{
    xensiv_radar_presence_event_t last_reported_event;
    bool verbose;
    XENSIV_RADAR_PRESENCE_TIMESTAMP bookmark_timestamp;
}ce_state_s;

/*******************************************************************************
 * Function Prototypes
 ********************************************************************************/
static BaseType_t set_max_range(char *pcWriteBuffer, size_t xWriteBufferLen,
        const char *pcCommandString);
static BaseType_t set_macro_threshold(char *pcWriteBuffer,
        size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t set_micro_threshold(char *pcWriteBuffer,
        size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t turn_bandpass_filter(char *pcWriteBuffer,
        size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t turn_decimation_filter(char *pcWriteBuffer,
        size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t set_presence_mode(char *pcWriteBuffer, size_t xWriteBufferLen,
        const char *pcCommandString);
static BaseType_t display_board_Info(char *pcWriteBuffer, size_t xWriteBufferLen,
        const char *pcCommandString);
static BaseType_t display_solution_config(char *pcWriteBuffer, size_t xWriteBufferLen,
        const char *pcCommandString); 
static BaseType_t set_verbose(char *pcWriteBuffer,
        size_t xWriteBufferLen, const char *pcCommandString);
static inline bool check_bool_validation(const char *value, const char *enable,
        const char *disable);
static inline bool check_float_validation(float32_t value, float32_t min,
        float32_t max);
static inline bool string_to_bool(const char *string, const char *enable,
        const char *disable);
static inline bool check_mode_validation(const char *mode);
static inline xensiv_radar_presence_mode_t string_to_mode(const char *mode);
extern void presence_detection_cb(xensiv_radar_presence_handle_t handle,
        const xensiv_radar_presence_event_t *event, void *data);

/*******************************************************************************
 * Variables
 ********************************************************************************/
static const CLI_Command_Definition_t command_list[NUMBER_OF_COMMANDS] =
{
    {
        .pcCommand = "set_max_range",
        .pcHelpString = "set_max_range <value> - Sets the max range for presence algorithm in meters. Range <0.66-5.0>\n",
        .pxCommandInterpreter = set_max_range,
        .cExpectedNumberOfParameters = 1
    },
    {
        .pcCommand = "set_macro_threshold",
        .pcHelpString = "set_macro_threshold <value> - Sets macro threshold for presence algorithm. Range <0.5-2.0>\n",
        .pxCommandInterpreter = set_macro_threshold,
        .cExpectedNumberOfParameters = 1
    },
    {
        .pcCommand = "set_micro_threshold",
        .pcHelpString = "set_micro_threshold <value> - Sets micro threshold for presence algorithm. Range <0.2-50.0>\n",
        .pxCommandInterpreter = set_micro_threshold,
        .cExpectedNumberOfParameters = 1
    },
    {
        .pcCommand = "set_bandpass_filter",
        .pcHelpString = "set_bandpass_filter <enable|disable> - Enabling/disabling bandpass filter\n",
        .pxCommandInterpreter = turn_bandpass_filter,
        .cExpectedNumberOfParameters = 1
    },
    {
        .pcCommand = "set_decimation_filter",
        .pcHelpString = "set_decimation_filter <enable|disable> - Enabling/disabling decimation filter\n",
        .pxCommandInterpreter = turn_decimation_filter,
        .cExpectedNumberOfParameters = 1
    },
    {
        .pcCommand = "set_mode",
        .pcHelpString = "set_mode <macro_only|micro_only|micro_if_macro|micro_and_macro> - Chooses work mode\n",
        .pxCommandInterpreter = set_presence_mode,
        .cExpectedNumberOfParameters = 1
    },
    {
        .pcCommand = "verbose",
        .pcHelpString = "verbose <enable|disable> - Enable/disable detailed verbose status to be updated every second\n",
        .pxCommandInterpreter = set_verbose,
        .cExpectedNumberOfParameters = 1
    },
    {
        .pcCommand = "board_info",
        .pcHelpString = "board_info -  Board_Information\n",
        .pxCommandInterpreter = display_board_Info,
        .cExpectedNumberOfParameters = 0
    },
    {
        .pcCommand = "config",
        .pcHelpString = "config - solution configuration information\n",
        .pxCommandInterpreter = display_solution_config,
        .cExpectedNumberOfParameters = 0
    }
};

static xensiv_radar_presence_handle_t handle;
extern ce_state_s ce_app_state;

