Infineon/mtb-example-psoc6-radar-presence/source/cli_task.c
/*******************************************************************************
 * Function Name: console_task
 ********************************************************************************
 * Summary:
 * This is the console task.
 *    1. Register commands
 *    2. In loop there are two modes: presence when the events are detected and setting_mode, when the user can change
 *work parameters
 *       - Waits for a sign
 *       - When ENTER is hit go to the settings mode
 *       - Use 'help' command to know what commands are available
 *       - Type commands with values to change parameters
 *       - Press ESC to exit settings mode and go again to presence mode
 *
 * Parameters:
 *  void
 *
 * Return:
 *  None
 *
 *******************************************************************************/
__NO_RETURN void console_task(void *pvParameters)
{
    int8_t cInputIndex = 0;
    BaseType_t xMoreDataToFollow;
    /* The input and output buffers are declared static to keep them off the stack. */
    static char pcOutputString[MAX_OUTPUT_LENGTH];
    static char pcInputString[MAX_INPUT_LENGTH];
    bool setting_mode = false;

    handle = (xensiv_radar_presence_handle_t) pvParameters;
    CY_ASSERT(handle != NULL);

    setvbuf(stdin, NULL, _IONBF, 0);
    setvbuf(stdout, NULL, _IONBF, 0);

    for (int32_t i = 0; i < NUMBER_OF_COMMANDS; ++i)
    {
        FreeRTOS_CLIRegisterCommand(&command_list[i]);
    }

    for (;;)
    {
        /* Wait for a sign */
        int32_t c = getchar();

        if (!setting_mode)
        {
            /* Enter setting mode */
            if (c == ENTER_KEY)
            {
                cInputIndex = 0;
                memset(pcInputString, 0x00, MAX_INPUT_LENGTH);
                setting_mode = true;
                xensiv_radar_presence_set_callback(handle, NULL, NULL);
                printf("\r\nEnter setting mode and stop processing\r\n"
                        "> ");
            }
        }
        else
        {
            /* Exit setting mode */
            if (c == ESC_KEY)
            {
                cInputIndex = 0;
                memset(pcInputString, 0x00, MAX_INPUT_LENGTH);
                setting_mode = false;
                printf("\r\nQuit from settings menu and back to processing\r\n\n");
                xensiv_radar_presence_set_callback(handle, presence_detection_cb, NULL);
            }
            else if (c == ENTER_KEY) // confirm entered text
            {
                putchar('\n');

                /* The command interpreter is called repeatedly until it returns
                 pdFALSE.  See the "Implementing a command" documentation for an
                 explanation of why this is. */
                do {
                    /* Send the command string to the command interpreter.  Any
                     output generated by the command interpreter will be placed in the
                     pcOutputString buffer. */
                    xMoreDataToFollow = FreeRTOS_CLIProcessCommand(
                            pcInputString, /* The command string.*/
                            pcOutputString, /* The output buffer. */
                            MAX_OUTPUT_LENGTH /* The size of the output buffer. */
                    );

                    /* Write the output generated by the command interpreter to the
                     console. */
                    printf("%s", pcOutputString);
                } while (xMoreDataToFollow != pdFALSE);

                /* All the strings generated by the input command have been sent.
                 Processing of the command is complete.  Clear the input string ready
                 to receive the next command. */
                cInputIndex = 0;
                memset(pcInputString, 0x00, MAX_INPUT_LENGTH);

                printf("> ");
            }
            else
            {
                if (c == BACKSPACE_KEY)
                {
                    /* Backspace was pressed.  Erase the last character in the input
                     buffer - if there are any. */
                    if (cInputIndex > 0)
                    {
                        cInputIndex--;
                        pcInputString[cInputIndex] = ' ';
                        putchar(BACKSPACE_KEY);
                    }
                }
                else
                {
                    /* A character was entered.  It was not a new line, backspace
                     or carriage return, so it is accepted as part of the input and
                     placed into the input buffer.  When a \n is entered the complete
                     string will be passed to the command interpreter. */
                    if (cInputIndex < MAX_INPUT_LENGTH)
                    {
                        pcInputString[cInputIndex] = c;
                        cInputIndex++;
                        putchar(c);
                    }
                }
            }
        }
    }
}

/*******************************************************************************
 * Function Name: set_max_range
 ********************************************************************************
 * Summary:
 *   Sets the max range for presence detection algorithm
 *
 * Parameters:
 *   pcWriteBuffer: buffer into which the output from executing the command can be written
 *   xWriteBufferLen:length, in bytes of the pcWriteBuffer buffer
 *   pcCommandString: entire string as input by
 the user (from which parameters can be extracted)
 *
 * Return:
 *   pdFALSE indicating that the function ends it's processing
 *******************************************************************************/
static BaseType_t set_max_range(char *pcWriteBuffer, size_t xWriteBufferLen,
        const char *pcCommandString)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    float32_t float_value = 0.0;
    xensiv_radar_presence_config_t config;
    const char *pcParameter;
    BaseType_t lParameterStringLength;
    float32_t maxRange;

    configASSERT(pcWriteBuffer);

    /* Obtain the parameter string. */
    pcParameter = FreeRTOS_CLIGetParameter(pcCommandString, /* The command string itself. */
            1, /* Return the first parameter. */
            &lParameterStringLength); /* Store the parameter string length. */

    configASSERT(pcParameter);
    result = xensiv_radar_presence_get_config(handle, &config);

    if (result != XENSIV_RADAR_PRESENCE_OK)
    {
        sprintf(pcWriteBuffer, "Error while reading presence config\r\n");
    }
    else
    {
        float_value = strtof(pcParameter, NULL);

        if (check_float_validation(float_value, MAX_RANGE_MIN_LIMIT, MAX_RANGE_MAX_LIMIT))
        {
            config.max_range_bin = (int32_t) (float_value
                    / (xensiv_radar_presence_get_bin_length(handle)));
            vTaskSuspendAll();
            result = xensiv_radar_presence_set_config(handle, &config);
            xensiv_radar_presence_reset(handle);
            xTaskResumeAll();
            maxRange = (xensiv_radar_presence_get_bin_length(handle)* config.max_range_bin);

            if (result != XENSIV_RADAR_PRESENCE_OK)
            {
                sprintf(pcWriteBuffer, "Error while setting new config.\r\n\n");
            }
            else
            {
                sprintf(pcWriteBuffer," [CONFIG] max_range %f \r\n\n", maxRange);
            }
        }
        else
        {
            sprintf(pcWriteBuffer, "Invalid value.\r\n\n");
        }
    }

