Infineon/mtb-example-psoc6-radar-presence/source/cli_task.c
    return pdFALSE;
}

/*******************************************************************************
 * Function Name: set_macro_threshold
 ********************************************************************************
 * Summary:
 *   Sets macro threshold for presence detection algorithm
 *
 * Parameters:
 *   pcWriteBuffer: buffer into which the output from executing the command can be written
 *   xWriteBufferLen:length, in bytes of the pcWriteBuffer buffer
 *   pcCommandString: entire string as input by
 the user (from which parameters can be extracted)
 *
 * Return:
 *   pdFALSE indicating that the function ends it's processing
 *******************************************************************************/
static BaseType_t set_macro_threshold(char *pcWriteBuffer,
        size_t xWriteBufferLen, const char *pcCommandString)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    float32_t float_value = 0.0;
    xensiv_radar_presence_config_t config;
    const char *pcParameter;
    BaseType_t lParameterStringLength;

    configASSERT(pcWriteBuffer);

    /* Obtain the parameter string. */
    pcParameter = FreeRTOS_CLIGetParameter(pcCommandString, /* The command string itself. */
            1, /* Return the first parameter. */
            &lParameterStringLength); /* Store the parameter string length. */

    configASSERT(pcParameter);
    result = xensiv_radar_presence_get_config(handle, &config);

    if (result != XENSIV_RADAR_PRESENCE_OK)
    {
        sprintf(pcWriteBuffer, "Error while reading presence config\r\n");
    }
    else
    {
        float_value = strtof(pcParameter, NULL);

        if (check_float_validation(float_value, MACRO_THRESHOLD_MIN_LIMIT,
                MACRO_THRESHOLD_MAX_LIMIT))
        {
            config.macro_threshold = float_value;
            vTaskSuspendAll();
            result = xensiv_radar_presence_set_config(handle, &config);
            xensiv_radar_presence_reset(handle);
            xTaskResumeAll();

            if (result != XENSIV_RADAR_PRESENCE_OK)
            {
                sprintf(pcWriteBuffer, "Error while setting new config.\r\n\n");
            }
            else
            {
                sprintf(pcWriteBuffer, "[CONFIG] macro_threshold %f \r\n\n",config.macro_threshold);
            }
        }
        else
        {
            sprintf(pcWriteBuffer, "Invalid value.\r\n\n");
        }
    }

    return pdFALSE;
}

/*******************************************************************************
 * Function Name: set_micro_threshold
 ********************************************************************************
 * Summary:
 *   Sets micro threshold for presence detection algorithm
 *
 * Parameters:
 *   pcWriteBuffer: buffer into which the output from executing the command can be written
 *   xWriteBufferLen:length, in bytes of the pcWriteBuffer buffer
 *   pcCommandString: entire string as input by
 the user (from which parameters can be extracted)
 *
 * Return:
 *   pdFALSE indicating that the function ends it's processing
 *******************************************************************************/
static BaseType_t set_micro_threshold(char *pcWriteBuffer,
        size_t xWriteBufferLen, const char *pcCommandString)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    float32_t float_value = 0.0;
    xensiv_radar_presence_config_t config;
    const char *pcParameter;
    BaseType_t lParameterStringLength;

    configASSERT(pcWriteBuffer);

    /* Obtain the parameter string. */
    pcParameter = FreeRTOS_CLIGetParameter(pcCommandString, /* The command string itself. */
            1, /* Return the first parameter. */
            &lParameterStringLength); /* Store the parameter string length. */

    configASSERT(pcParameter);
    result = xensiv_radar_presence_get_config(handle, &config);

    if (result != XENSIV_RADAR_PRESENCE_OK)
    {
        sprintf(pcWriteBuffer, "Error while reading presence config\r\n");
    }
    else
    {
        float_value = strtof(pcParameter, NULL);

        if (check_float_validation(float_value, MICRO_THRESHOLD_MIN_LIMIT,
                MICRO_THRESHOLD_MAX_LIMIT))
        {
            config.micro_threshold = float_value;
            vTaskSuspendAll();
            result = xensiv_radar_presence_set_config(handle, &config);
            xensiv_radar_presence_reset(handle);
            xTaskResumeAll();

            if (result != XENSIV_RADAR_PRESENCE_OK)
            {
                sprintf(pcWriteBuffer, "Error while setting new config.\r\n\n");
            }
            else
            {
                sprintf(pcWriteBuffer, "[CONFIG] micro_threshold %f \r\n\n",config.micro_threshold);
            }
        }
        else
        {
            sprintf(pcWriteBuffer, "Invalid value.\r\n\n");
        }
    }

    return pdFALSE;
}

/*******************************************************************************
 * Function Name: turn_bandpass_filter
 ********************************************************************************
 * Summary:
 *   Turning on/off bandpass filter for presence detection algorithm
 *
 * Parameters:
 *   pcWriteBuffer: buffer into which the output from executing the command can be written
 *   xWriteBufferLen:length, in bytes of the pcWriteBuffer buffer
 *   pcCommandString: entire string as input by
 the user (from which parameters can be extracted)
 *
 * Return:
 *   pdFALSE indicating that the function ends it's processing
 *******************************************************************************/
static BaseType_t turn_bandpass_filter(char *pcWriteBuffer,
        size_t xWriteBufferLen, const char *pcCommandString)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    xensiv_radar_presence_config_t config;
    const char *pcParameter;
    BaseType_t lParameterStringLength;

    configASSERT(pcWriteBuffer);

    /* Obtain the parameter string. */
    pcParameter = FreeRTOS_CLIGetParameter(pcCommandString, /* The command string itself. */
            1, /* Return the first parameter. */
            &lParameterStringLength); /* Store the parameter string length. */

    configASSERT(pcParameter);
    result = xensiv_radar_presence_get_config(handle, &config);

    if (result != XENSIV_RADAR_PRESENCE_OK)
    {
        sprintf(pcWriteBuffer, "Error while reading presence config\r\n");
    }
    else
    {
        if (check_bool_validation(pcParameter, ENABLE_STRING, DISABLE_STRING))
        {
            config.macro_fft_bandpass_filter_enabled = string_to_bool(
                    pcParameter, ENABLE_STRING, DISABLE_STRING);
            vTaskSuspendAll();
            result = xensiv_radar_presence_set_config(handle, &config);
            xensiv_radar_presence_reset(handle);
            xTaskResumeAll();
            if (result != XENSIV_RADAR_PRESENCE_OK)
            {
                sprintf(pcWriteBuffer, "Error while setting new config.\r\n\n");
            }
            else
            {
                sprintf(pcWriteBuffer, "[CONFIG] bandpass_filter %s \r\n\n", pcParameter);
            }
        }
        else
        {
            sprintf(pcWriteBuffer, "Invalid value.\r\n\n");
        }
    }

