Infineon/mtb-example-psoc6-radar-presence/source/cli_task.c
    return pdFALSE;
}

/*******************************************************************************
 * Function Name: turn_decimation_filter
 ********************************************************************************
 * Summary:
 *   Turning on/off decimation filter for presence detection algorithm
 *
 * Parameters:
 *   pcWriteBuffer: buffer into which the output from executing the command can be written
 *   xWriteBufferLen:length, in bytes of the pcWriteBuffer buffer
 *   pcCommandString: entire string as input by
 the user (from which parameters can be extracted)
 *
 * Return:
 *   pdFALSE indicating that the function ends it's processing
 *******************************************************************************/
static BaseType_t turn_decimation_filter(char *pcWriteBuffer,
        size_t xWriteBufferLen, const char *pcCommandString)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    xensiv_radar_presence_config_t config;
    const char *pcParameter;
    BaseType_t lParameterStringLength;

    configASSERT(pcWriteBuffer);

    /* Obtain the parameter string. */
    pcParameter = FreeRTOS_CLIGetParameter(pcCommandString, /* The command string itself. */
            1, /* Return the first parameter. */
            &lParameterStringLength); /* Store the parameter string length. */

    configASSERT(pcParameter);
    result = xensiv_radar_presence_get_config(handle, &config);

    if (result != XENSIV_RADAR_PRESENCE_OK)
    {
        sprintf(pcWriteBuffer, "Error while reading presence config\r\n");
    }
    else
    {
        if (check_bool_validation(pcParameter, ENABLE_STRING, DISABLE_STRING))
        {
            config.micro_fft_decimation_enabled = string_to_bool(pcParameter,
                    ENABLE_STRING, DISABLE_STRING);
            vTaskSuspendAll();
            result = xensiv_radar_presence_set_config(handle, &config);
            xensiv_radar_presence_reset(handle);
            xTaskResumeAll();

            if (result != XENSIV_RADAR_PRESENCE_OK)
            {
                sprintf(pcWriteBuffer, "Error while setting new config.\r\n\n");
            }
            else
            {
                sprintf(pcWriteBuffer, "[CONFIG] decimation_filter %s \r\n\n", pcParameter);
            }
        }
        else
        {
            sprintf(pcWriteBuffer, "Invalid value.\r\n\n");
        }
    }

    return pdFALSE;
}

/*******************************************************************************
 * Function Name: set_presence_mode
 ********************************************************************************
 * Summary:
 *   Setting mode for presence detection algorithm
 *
 * Parameters:
 *   pcWriteBuffer: buffer into which the output from executing the command can be written
 *   xWriteBufferLen:length, in bytes of the pcWriteBuffer buffer
 *   pcCommandString: entire string as input by
 the user (from which parameters can be extracted)
 *
 * Return:
 *   pdFALSE indicating that the function ends it's processing
 *******************************************************************************/
static BaseType_t set_presence_mode(char *pcWriteBuffer, size_t xWriteBufferLen,
        const char *pcCommandString)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    xensiv_radar_presence_config_t config;
    const char *pcParameter;
    BaseType_t lParameterStringLength;

    configASSERT(pcWriteBuffer);

    /* Obtain the parameter string. */
    pcParameter = FreeRTOS_CLIGetParameter(pcCommandString, /* The command string itself. */
            1, /* Return the first parameter. */
            &lParameterStringLength); /* Store the parameter string length. */

    configASSERT(pcParameter);
    result = xensiv_radar_presence_get_config(handle, &config);

    if (result != XENSIV_RADAR_PRESENCE_OK)
    {
        sprintf(pcWriteBuffer, "Error while reading presence config\r\n");
    }
    else
    {
        if (check_mode_validation(pcParameter))
        {
            xensiv_radar_presence_mode_t mode = string_to_mode(pcParameter);

            config.mode = mode;
            vTaskSuspendAll();
            result = xensiv_radar_presence_set_config(handle, &config);
            xensiv_radar_presence_reset(handle);
            xTaskResumeAll();

            result = radar_config_optimizer_set_operational_mode(mode);
            if(result != ESTATUS_SUCCESS)
            {
                sprintf(pcWriteBuffer, "Error while setting new operational mode.\r\n\n");
            }

            if (result != XENSIV_RADAR_PRESENCE_OK)
            {
                sprintf(pcWriteBuffer, "Error while setting new config.\r\n\n");
            }
            else
            {
                sprintf(pcWriteBuffer, "[CONFIG] set_mode %s \r\n\n", pcParameter);
            }
        }
        else
        {
            sprintf(pcWriteBuffer, "Invalid value.\r\n\n");
        }
    }

    return pdFALSE;
}


/*******************************************************************************
 * Function Name: set_verbose
 ********************************************************************************
 * Summary:
 *   Turning on/off bandpass filter for presence detection algorithm
 *
 * Parameters:
 *   pcWriteBuffer: buffer into which the output from executing the command can be written
 *   xWriteBufferLen:length, in bytes of the pcWriteBuffer buffer
 *   pcCommandString: entire string as input by
 the user (from which parameters can be extracted)
 *
 * Return:
 *   pdFALSE indicating that the function ends it's processing
 *******************************************************************************/
static BaseType_t set_verbose(char *pcWriteBuffer,
        size_t xWriteBufferLen, const char *pcCommandString)
{
    const char *pcParameter;
    BaseType_t lParameterStringLength;

    configASSERT(pcWriteBuffer);

    /* Obtain the parameter string. */
    pcParameter = FreeRTOS_CLIGetParameter(pcCommandString, /* The command string itself. */
            1, /* Return the first parameter. */
            &lParameterStringLength); /* Store the parameter string length. */

    configASSERT(pcParameter);
    if (check_bool_validation(pcParameter, ENABLE_STRING, DISABLE_STRING))
    {
        ce_app_state.verbose = string_to_bool(pcParameter,
                ENABLE_STRING, DISABLE_STRING);
        sprintf(pcWriteBuffer, "ok\n");
    }
    else
    {
        sprintf(pcWriteBuffer, "Invalid value.\r\n\n");
    }

