Infineon/mtb-example-psoc6-radar-presence/source/cli_task.c
    return pdFALSE;

}

/*******************************************************************************
 * Function Name: display_device_Info
 ********************************************************************************
 * Summary:
 *   Query for device information
 *
 * Parameters:
 *   pcWriteBuffer: buffer into which the output from executing the command can be written
 *   xWriteBufferLen:length, in bytes of the pcWriteBuffer buffer
 *   pcCommandString: entire string as input by the user (from which parameters can be extracted)
 *
 * Return:
 *   pdFALSE indicating that the function ends it's processing
 *******************************************************************************/
static BaseType_t display_board_Info(char *pcWriteBuffer, size_t xWriteBufferLen,
        const char *pcCommandString)
{
    printf(BOARD_INFO);
    printf("\n");
    printf(BOARD_INFO_APPLICATION);
    printf("\n");
    printf(BOARD_INFO_FIRMWARE);
    printf("\n");
    printf(BOARD_INFO_DEVICE_NAME);
    printf("\n");
    printf(BOARD_INFO_DEVICE_VERSION);
    printf("\n");
    printf(BOARD_INFO);
    sprintf(pcWriteBuffer, "\n");

    return pdFALSE;
}

/*******************************************************************************

 * Function Name: display_solution_config
 ********************************************************************************
 * Summary:
 *   display solution configuration
 *
 * Parameters:
 *   pcWriteBuffer: buffer into which the output from executing the command can be written
 *   xWriteBufferLen:length, in bytes of the pcWriteBuffer buffer
 *   pcCommandString: entire string as input by
 the user (from which parameters can be extracted)
 *
 * Return:
 *   pdFALSE indicating that the function ends it's processing
 *******************************************************************************/

static BaseType_t display_solution_config(char *pcWriteBuffer, size_t xWriteBufferLen,
        const char *pcCommandString)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    xensiv_radar_presence_config_t config;
    float32_t maxRange;
    float32_t minRange;

    result = xensiv_radar_presence_get_config(handle, &config);

    maxRange = (xensiv_radar_presence_get_bin_length(handle)* config.max_range_bin);
    minRange = (xensiv_radar_presence_get_bin_length(handle)* config.min_range_bin);

    const char* mode = MACRO_ONLY_STRING;
    if(config.mode == XENSIV_RADAR_PRESENCE_MODE_MICRO_ONLY) 
    {
        mode = MICRO_ONLY_STRING;
    } 
    else if(config.mode == XENSIV_RADAR_PRESENCE_MODE_MICRO_IF_MACRO)
    {
        mode = MICRO_IF_MACRO_STRING;
    }
    else if(config.mode == XENSIV_RADAR_PRESENCE_MODE_MICRO_AND_MACRO)
    {
        mode = MICRO_AND_MACRO_STRING;
    }

    if (result != XENSIV_RADAR_PRESENCE_OK)
    {
        sprintf(pcWriteBuffer, "Error while reading presence config\r\n");
    }
    else 
    {
        printf(CONFIG);
        printf("\n");
        printf(CONFIG_MODE);
        printf("%s",mode);
        printf("\n");   
        printf(CONFIG_MAX_RANGE);
        printf("%f",maxRange);
        printf("\n");   
        printf(CONFIG_MIN_RANGE);
        printf("%f",minRange);
        printf("\n");
        printf(CONFIG_MACRO_THRESHOLD);
        printf("%f",config.macro_threshold);
        printf("\n");
        printf(CONFIG_MICRO_THRESHOLD);
        printf("%f",config.micro_threshold);
        printf("\n");
        printf(CONFIG_BANDPASS_FILTER);
        (config.macro_fft_bandpass_filter_enabled == true)?printf("enable"):printf("disable");
        printf("\n");
        printf(CONFIG_DECIMATION_FILTER);
        (config.micro_fft_decimation_enabled == true)?printf("enable"):printf("disable");
        printf("\n");

        printf(CONFIG);
        sprintf(pcWriteBuffer, "\n");
    }

    return pdFALSE;
}


/*******************************************************************************
 * Function Name: check_bool_validation
 ********************************************************************************
 * Summary:
 *   Checks if entered value is a proper string for enable or disable
 *
 * Parameters:
 *   value : Entered string value
 *   enable : String value for enable
 *   disable : String value for disable
 *
 * Return:
 *   True if the value is same as enable or disable value, false if it is different
 *******************************************************************************/
static inline bool check_bool_validation(const char *value, const char *enable,
        const char *disable)
{
    bool result = false;

    if ((strcmp(value, enable) == 0) || (strcmp(value, disable) == 0))
    {
        result = true;
    }
    else
    {
        result = false;
    }

    return result;
}

/*******************************************************************************
 * Function Name: check_float_validation
 ********************************************************************************
 * Summary:
 *   Checks if entered value is within a range
 *
 * Parameters:
 *   value : Entered float value
 *   min : Minimum value
 *   max : Maximum value
 *
 * Return:
 *   True if the value is within a range, false if not
 *******************************************************************************/
static inline bool check_float_validation(float32_t value, float32_t min, float32_t max)
{
    bool result = false;

    if ((value >= min) && (value <= max))
    {
        result = true;
    }
    else
    {
        result = false;
    }

    return result;
}

/*******************************************************************************
 * Function Name: string_to_bool
 ********************************************************************************
 * Summary:
 *   Converts string value to true or false
 *
 * Parameters:
 *   string : Entered string value
 *   enable : String for enable value
 *   disable : String for disable value
 *
 * Return:
 *   True if entered string is enable, false if disable
 *******************************************************************************/
static inline bool string_to_bool(const char *string, const char *enable,
        const char *disable)
{
    assert((strcmp(string, enable) == 0) || (strcmp(string, disable) == 0));
    bool result = false;

    if (strcmp(string, enable) == 0)
    {
        result = true;
    }
    else
    {
        result = false;
    }

    return result;
}


