Infineon/mtb-example-psoc6-radar-presence/source/cli_task.c
/*******************************************************************************
 * Function Name: check_mode_validation
 ********************************************************************************
 * Summary:
 *   Checks if entered value is a proper mode value
 *
 * Parameters:
 *   value : Entered mode value
 *
 * Return:
 *   True if the value is correct, false if the value is incorrect
 *******************************************************************************/
static inline bool check_mode_validation(const char *mode)
{
    bool result = false;

    if ((strcmp(mode, MACRO_ONLY_STRING) == 0)
            || (strcmp(mode, MICRO_ONLY_STRING) == 0)
            || (strcmp(mode, MICRO_IF_MACRO_STRING) == 0)
            || (strcmp(mode, MICRO_AND_MACRO_STRING) == 0))
    {
        result = true;
    }
    else
    {
        result = false;
    }

    return result;
}

/*******************************************************************************
 * Function Name: string_to_mode
 ********************************************************************************
 * Summary:
 *   Translates string value into a numeral value for mode
 *
 * Parameters:
 *   value : Entered string
 *
 * Return:
 *   Presence mode value
 *******************************************************************************/
static inline xensiv_radar_presence_mode_t string_to_mode(const char *mode)
{
    xensiv_radar_presence_mode_t result = XENSIV_RADAR_PRESENCE_MODE_MACRO_ONLY;

    if (strcmp(mode, MACRO_ONLY_STRING) == 0)
    {
        result = XENSIV_RADAR_PRESENCE_MODE_MACRO_ONLY;
    }
    else if (strcmp(mode, MICRO_ONLY_STRING) == 0)
    {
        result = XENSIV_RADAR_PRESENCE_MODE_MICRO_ONLY;
    }
    else if (strcmp(mode, MICRO_IF_MACRO_STRING) == 0)
    {
        result = XENSIV_RADAR_PRESENCE_MODE_MICRO_IF_MACRO;
    }
    else if (strcmp(mode, MICRO_AND_MACRO_STRING) == 0)
    {
        result = XENSIV_RADAR_PRESENCE_MODE_MICRO_AND_MACRO;
    }
    else
    {

    }

    return result;
}
